Autodesk.Revit.DB.CompoundStructure.CreateSingleLayerCompoundStructure(System.Double,Autodesk.Revit.DB.MaterialFunctionAssignment,System.Double,Autodesk.Revit.DB.ElementId)
Creates a vertically compound CompoundStructure with one layer.
Remarks:
It is not verified that materialId corresponds to a valid MaterialElem.
sampleHeight:
The sample height of this vertically compound structure.
layerFunction:
The function of the single layer.
width:
The width of the single layer.
materialId:
The ElementId of the material for the single layer.
Returns:
The newly created compound structure.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for sampleHeight must be greater than 0 and no more than 30000 feet.
-or-
The given value for width must be greater than 0 and no more than 30000 feet.
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructure.CreateSingleLayerCompoundStructure(Autodesk.Revit.DB.MaterialFunctionAssignment,System.Double,Autodesk.Revit.DB.ElementId)
Creates a CompoundStructure containing a single layer.
Remarks:
It is not verified that materialId corresponds to a valid Material element.
layerFunction:
The function of the single layer.
width:
The width of the single layer.
materialId:
The ElementId of the material for the single layer.
Returns:
The newly created compound structure.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for width must be greater than 0 and no more than 30000 feet.
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructure.CreateSimpleCompoundStructure(System.Collections.Generic.IList{Autodesk.Revit.DB.CompoundStructureLayer})
Creates a non-vertically compound structure comprised of parallel layers.
Remarks:
All layers are in the core, i.e. there are no shell layers created.
layers:
An array which describes the parallel layers of this compound structure.
Returns:
A newly created compound structure.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more layers is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.CompoundStructure.AddWallSweep(Autodesk.Revit.DB.WallSweepInfo)
Adds a new wall sweep or reveal to the compound structure.
Remarks:
A wall sweep is an object that is created by sweeping a closed 2d profile along a horizontal line
that is positioned on one side (exterior or interior) of the hosting wall.
A reveal is a special wall sweep with a void shape that is subtracted from the hosting wall.
The id field of the WallSweepInfo must be populated with a non-negative integer value.
If there already is a sweep defined for this id, its parameters will be changed.
A new sweep will be created if no existing one has matching id.
wallSweepInfo:
The wall sweep info to create a wall sweep.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The wall sweep info does not represent a fixed wall sweep.  Only fixed wall sweeps may be assigned to vertical compound structures.
-or-
The WallSweepInfo has an invalid id for a fixed wall sweep.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.SetExtendableRegionIds(System.Boolean,System.Collections.Generic.IList{System.Int32})
Sets the extendable region ids for the compound structure.
Remarks:
Regions along the top or bottom of the wall may be set to be extendable.
top:
If true, set ids of regions which are extendable at the top, otherwise
set the ids of regions which are extendable at the bottom.
regionIds:
The ids of regions which will be extendable.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The region ids are not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.FindEnclosingRegionAndSegments(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.RectangularGridSegmentOrientation,System.Int32@,System.Int32@)
Given a pair of grid coordinates, and a direction for splitting, returns the enclosing region and the two segments
intersected by a line through the grid point.
Remarks:
Grid coordinates correspond to uv coordinates of faces.
gridUV:
Coordinates of a point in the rectangular grid of this compound structure.
splitDirection:
Specifies the direction of the split.
segmentId1:
The id of a segment in the boundary of the containing region which is split by a line through gridUV in the specified direction.
segmentId2:
The id of a segment in the boundary of the containing region which is split by a line through gridUV in the specified direction.
Returns:
Returns the id of the enclosing region, and -1 if no region encloses the point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.SplitRegion(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.RectangularGridSegmentOrientation)
Splits the region which contains the specified grid point by a line with the specified direction.
Remarks:
This method is meant to be used in conjunction with Autodesk.Revit.DB.CompoundStructure.FindEnclosingRegionAndSegments(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.RectangularGridSegmentOrientation,System.Int32@,System.Int32@).
Grid coordinates correspond to uv coordinates of faces.
gridUV:
Coordinates of a point in the rectangular grid of this compound structure.
splitDirection:
Specifies the direction of the split.
Returns:
The id of the region created by this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Split and merge regions operations can be used only for vertically compound structures without variable thickness layers.

Autodesk.Revit.DB.CompoundStructure.SplitRegion(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.RectangularGridSegmentOrientation,System.Int32@)
Splits the region which contains the specified grid point by a line with the specified direction.
Remarks:
This method is meant to be used in conjunction with Autodesk.Revit.DB.CompoundStructure.FindEnclosingRegionAndSegments(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.RectangularGridSegmentOrientation,System.Int32@,System.Int32@).
Grid coordinates correspond to uv coordinates of faces.
gridUV:
Coordinates of a point in the rectangular grid of this compound structure.
splitDirection:
Specifies the direction of the split.
newSegmentId:
The id of segment that bounds both the original region and the new region.
Returns:
The id of the region created by this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Split and merge regions operations can be used only for vertically compound structures without variable thickness layers.

Autodesk.Revit.DB.CompoundStructure.MergeRegionsAdjacentToSegment(System.Int32,System.Int32)
Merges the two regions which share the specified segment.
segmentId:
The id of a segment in the underlying grid.
layerIdxForMergedRegion:
The index of the layer to which the resulting region will be associated.
Returns:
The id of the resulting region. If -1 is returned, then the operation would have produced
an invalid region and was not performed.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Split and merge regions operations can be used only for vertically compound structures without variable thickness layers.
-or-
The segment is not shared by adjacent regions.

Autodesk.Revit.DB.CompoundStructure.CanSplitAndMergeRegionsBeUsed
Checks whether split and merge regions operations can be used for this compound structure.
Returns:
True if split and merge regions operation can be used for this compound structure, false otherwise.

Autodesk.Revit.DB.CompoundStructure.IsLayerValid(System.Int32,Autodesk.Revit.DB.CompoundStructureLayer)
Verifies that the data in this layer is internally consistent.
Remarks:
If the layer function is not Membrane or StructuralDeck, the width must be greater than zero.
If the layer function is not StructuralDeck, then the deck embedding type must be Invalid, and the deck profile id must be InvalidElementId.
layerIdx:
The index of the layer in the compound structure to be set.
layer:
The layer to be set.
Returns:
True if the layer is internally consistent, false if the layer is not internally consistent.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.CompoundStructure.SetLayer(System.Int32,Autodesk.Revit.DB.CompoundStructureLayer)
Sets a single layer for this CompoundStructure.
Remarks:
This function does not support addition of new layers, use SetLayers() to change the number of layers.
layerIdx:
The index of a layer. This should range from 0 to the number of layers - 1.
layer:
The layer to be set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The layer is not valid for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for non-vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.SetLayers(System.Collections.Generic.IList{Autodesk.Revit.DB.CompoundStructureLayer})
Completely resets this CompoundStructure and applies a new set of layers.
Remarks:
This function will replace all existing layers with the contents of the input.  This provides a full
reset for the CompoundStructure. Therefore:
All layers will be marked as Core layers, and any settings related to Shell layers (such as Autodesk.Revit.DB.CompoundStructure.GetFirstCoreLayerIndex,
Autodesk.Revit.DB.CompoundStructure.GetLastCoreLayerIndex or Autodesk.Revit.DB.CompoundStructure.GetCoreBoundaryLayerIndex(Autodesk.Revit.DB.ShellLayerType)) will be modified accordingly.Because all layers will be set as Core layers, the value of LayerCapFlag will be ignored (and set to true) automatically.The Autodesk.Revit.DB.CompoundStructure.VariableLayerIndex will be unset.The Autodesk.Revit.DB.CompoundStructure.StructuralMaterialIndex will be unset.The compound structure will be set to be vertically homogeneous.
layers:
The layers to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.CompoundStructure.SetDeckProfileId(System.Int32,Autodesk.Revit.DB.ElementId)
Sets the profile loop to use for the specified structural deck.
layerIdx:
Index of a layer in the CompoundStructure.
profileId:
The element id of a FamilySymbol which contains a profile loop to be used by the specified layer if it is a structural deck.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The layer is not a structural deck.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.SetMaterialId(System.Int32,Autodesk.Revit.DB.ElementId)
Sets a material element for a specified layer.
Remarks:
It is not verified that materialId corresponds to a valid Material element.
layerIdx:
Index of a layer in the CompoundStructure.
materialId:
The ElementId of a Material element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.IsValid(Autodesk.Revit.DB.Document,System.Collections.Generic.IDictionary{System.Int32,Autodesk.Revit.DB.CompoundStructureError}@,System.Collections.Generic.IDictionary{System.Int32,System.Int32}@)
Checks for errors or inconsistencies in the data in this CompoundStructure.
Remarks:
This check is run before the CompoundStructure may be assigned to a particular ElementType.
doc:
Access to the document in which the CompoundStructure will be used.
errMap:
This map will associate each problematic layer index to a value in CompoundStructureError.
General structure errors are reported as associated to layer index -1.
twoLayerErrorsMap:
The map is associated to a check run only for vertically Compound Structures.
Essentially the Compound Structure is sliced at representative heights.
It looks at the region from exterior to interior, and requires that the assigned layer indices do not decrease.
If they do, an entry is generated for this map. The first entry is the last valid layer index encountered.
The second entry is a region id whose assigned layer index is too small: it should be at least as large as the first entry.
Returns:
True if the compound structure is valid for the document, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.CompoundStructure.IsEqual(Autodesk.Revit.DB.CompoundStructure)
Checks whether this CompoundStructure is the same as another CompoundStructure.
otherStructure:
A CompoundStructure.
Returns:
True if the two CompoundStructures are the same, and false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.CompoundStructure.VariableLayerIndex
Indicates the index of the layer which is designated as variable.
Remarks:
If the host object to which it is applied
has an actual width that exceeds the total width of all layers, then all layers except the variable layer
will be created with their specified width, and the variable layer will expand to take up the slack.
Generally this is applicable for floors and roofs with shape edits applied. There can be only one variable layer.
In the wall compound structure UI, when a layer is labeled 'variable' in the thickness column,
that means it is assigned either to a non-rectangular region, or it means the layer is assigned to two different layers.
Neither of those situations is what this method refers to.
The index of the layer specified as variable. If there is no variable layer, this value is -1.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The specified layer cannot be set to a variable layer.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The layer index is out of range.
-or-
When setting this property: The layer index is invalid.